const ideaData: ideaDataProject[] = [
	{
		name: "عينا سلسبيلا",
		explanation: [
			`نستطيع أن نختصر مشروع عينا سلسبيلا بالكامل حول فكرة حجب
						المواقع الإباحية خاصة و كل ما هو حرام عامة من على
						الانترنت و حماية اطفالنا من مصادر الشر هذه التي لم تدع
						احدا بدون أذية`,
			`و هذا المشروع في رأينا يحمل الأولوية القصوى بين أقرانه
						لما أصبح عليه حال شبابنا و أطفالنا في هذه الأيام. و قد
						من الله علينا بفضل الله بخادم لأسماء النطاقات (dns
						server) لحجب المواقع الإباحية و الإعلانات و غيرها كطبقة
						أولى للحماية، و هدفنا بإذن الله التوسع بعد ذلك و تقوية
						الحماية من ناحية صعوبة تخطيها و إلغائها و جودة حجبها
						بإذن الله تعالى بمشاريع عديدة`,
		],
	},
	{
		name: "نباتا حسنا",
		explanation: [
			`أما نباتا حسنا فهو على عكس ما فات، يعمل على توفير
            محتوى هادف للأطفال سواء كان كأفلام كرتون نجمعها مُنْتَجَةٌ بالفعل أو
            بإنتاج أفلام كرتون خاصة بنا إن شاء الله تعالى حين يتاح لنا ذلك
            لمزاحمة المحتوى الغربي المليء بالعيوب`,
			`و ليس هذا المشروع قائما على أفلام الكرتون فحسب، بل بإذن الله 
            كل ما يتيسر لنا من أدوات مدرسية أو كتب تلوين للأطفال تحمل بين 
            صفحاتها صورا للأقصى أو غيرها من الأشياء التي تساعد على تربية جيل
            صالح بإذن الله يحمل هم الأمة`,
		],
	},
	{
		name: "زدني علما",
		explanation: [
			`لا يخفى على أحد نقص المحتوى العلمي العربي بل نحن
			ننصح بتعلم اللغة الإنجليزية لمن أراد أن يتعمق في أي فن أو علم.
            فيأخذنا هذا إلى المشروع الثالث من مفازا و الذي يهدف بإذن الله
            إلى توفير محتوى علمي بكفائة و جودة عالية توازي ما لدى الغرب
            بل تسبقها بعون الله سبحانه و تعالى`,
			`و إن تيسر بإذن الله نسعى أيضا لترجمة الكتب و المراجع العلمية
            كأول خطوة في مشروع تعريب العلوم بإذن الله تعالى و على من يأتي 
            بعدنا يستفيد مما قدمناه إن شاء الله`,
		],
	},
	{
		name: "قرضا حسنا",
		explanation: [
			`ينقسم هذا المشروع إلى قسمين، الأول إن شاء الله يدور حول
            إعداد و تعليم و توعية و مساعدة الشباب لبدء مشاريعهم و تجاراتهم،
            فالمؤمن القوى خير و أحب إلى الله من المؤمن الضعيف، و نشارك مع
            الشباب بإذن الله ما أكرمنا الله به من خبرات أثناء العمل على هذا
            المشروع بإذن الله تعالى`,
			`أما الشق الثاني فيدور حول مساعدة عامة المسلمين ماديا إن شاء
            الله سواء كان بفتح باب مساعدة للمحتاجين أو إنشاء ما يعادل أو
            يقوم بوظيفة بنك إسلامي بدون ربا إن شاء الله تعالى حتى نُغني
            الناس و نعينهم إن شاء الله على عدم اللجوء إلى الربا`,
		],
	},
	{
		name: "pamylka",
		explanation: [
			`أما باميلكا فهو مشروع تابع لنا إن شاء الله وظيفته أن يمد هذا
            المشروع بالموارد المالية اللازمة إن شاء الله ليعمل و نستطيع
            تنفيذه على أكمل وجه إن شاء الله تعالى، ثم تقديم يد العون
            للشباب أن يقوموا بأعمال ناجحة إن شاء الله`,
			`و يعمل هذا المشروع أيضا على بناء منتجات نستبدل بها المنتجات
            الغربية بمنتجات تحت إدارة مسلمة تكافئها في الجودة بل تفوقها
            بعون الله سبحانه و تعالى`,
		],
	},
	{
		name: "و أخيرا",
		explanation: [
			`قد تبدوا هذه الأهداف صعبة بل قد يراها البعض مستحيلة، لكننا 
            نسدد و نقارب و نبذل ما بوسعنا و نقوم بأقصى جهد إن شاء الله 
            لأجل تحقيق ما نقدر عليه من هذه الأهداف، و الأهم هو الموت على
            الطريق و ليس النتيجة، فالله غالب على أمره و إن أراد شيئا
            فإنما يقول له كن فيكون، و هو كامل منزه على أن يحتاج إلى بعض
            المخلوقات الضعيفة قليلة الحيلة، بل نحن من نطمع إلى أن يستعملنا
            الله ولا يستبدلنا و أن ينفع بنا و يحيي بنا الدين إن شاء الله تعالى`,
			`ثم يا إخواني، باب التقديم مفتوح دائما إن شاء الله ولا نرفض أحدا بل
            ليس عندنا الرفاهية لذلك، فمن كان يود أن يساهم فأهلا و سهلا به،
            و من أراد أن ينضم إلينا كضيف و يشاهدنا فقط فأهلا و سهلا به أيضا، بل
            نحن نرجوا أن نكون بجعل بابنا مفتوحا سببا في إعانة شخص أن يتعلم
            شيئا أو اثنين جديدين، فياااااا مرحباا يا مرحبا و جزاكم الله عنا
            خير الجزاء، لا تنسونا من صالح دعائكم`,
		],
	},
];

export default ideaData;

type ideaDataProject = {
	name: string;
	explanation: string[];
};
